from fastapi import FastAPI
import random
import httpx 

    

jokes = [
'مرة واحد فات لي بتاع الدكان قال ليهو اديني طحنية قال ليهو ما عندي و هو عندو😆',
'قال ليك عسكري مع ايام حظر التجوال ديك قالو ليهو اي زول تشوفو حايم بعد الساعة 7 اديهو طلقة...الساعة 6 شاف ليهو زول في شارع عبيد ختم طاخ ضربو  بي طلقة...الجماعة سألوهن قتلته ليي؟..قال ليك دا انا عارفو ساكن الكلاكلة م ح يحصل سريع 🤣🤣🤣🤣🤣', 
'واحد حلب ليهو ليمونة رفستو🤣', 
'واحد خيالو واسع اتملص منو😆' ,
'واحد عمل ليه شاي  تقيل م قدر يشيلو😆' ,
'واحد جاب شعرو بالجمبه عشان كان دايرو في موضوع😆',
'واحد اسمو حسن نجيلة  نسى الباب فاتح الغنماية دخلت اكلت ابوه😆',
'واحد كراعو خدرت وداها المشتل😆',
'مره واحد اسمه احمد عماره داير ينتحر نط من فوق ابوه😆',
'واحدة شعرها ناعم ختتو ف شياله😆',
'واحد رجع في كلامه عفصو😆',
'ضابط مرور عرس ضابطة جابو اولاد بتكلمو بالاشارات😆',
'واحد اسمو سامح خت يدو في اضانو بقا م سامح😆',
'استاذ عربي وقع رفعوه بالضمه😆',
'واحده اسمها اسرار ضربتها عربيه الشارع اتملا فضايح😆',
'مسطول داير يقطع الزلط لقى السكينه ميته😆',
'واحده اسمها بسمه كبرت بقت توقيع😆',
'مره مدير عام ومدير غرق😆',
'واحد عرس صينيه شال فيها الاكل😆',
'استاذ رياضيات طقتو ركشه فات المستشفى قالو ليهو عندك كسور قاليهم وحدو المقامات😆',
'مسطول عرف انو الشيطان شاطر فات يراجع معاه حسبان',
'واحد رجلينو رقاق اتسحر بيهم😆',
'واحدة اسمها رنين غابت عن الدوام سجلوها مكالمه فائته😆',
'واحد عيونو صغار دخلهم الروضه😆',
'واحد أضانو تقيلة جاب لي درداقة😆',
'واحد حلق لبستو أختو😆']


def rate () :
    try :
        async with httpx.AsyncClient as client :
            response = client.get('')

app = FastAPI(version=1)

@app.get ('/')
def health () :
    return {'Server is Healthy 🌐'}

@app.get('/joke')
def rJoke () :
    joke = random.choice(jokes)
    return {"Joke" : joke , "Author" : 'TRAMAZOOL 💊'}

